{
  "authors": ["Dan Bunis"],
  "lastModified": "Dec 14, 2023",
  "vignette": "# The Single-cell Visualization Workflow\n\nThis workflow allows exploration of pre-processed single-cell datasets.\n\n## Overview of this Workflow's Steps\n1. Provide the record id of your target sc_seq_dataset. When you click `Run`, vulcan will import this record's Seurat object and assess its plottable features.\n2. Pick a plot type within the 'Set plot options' user interface. Afterwards, a new set of inputs for parameterizing that plot type will appear.\n3. Parameterize the plot setup: Pick your data targets as well as any tweaks or additions. Don't worry, you can always go back and adjust these selections later!\n4. View and assess your plot. If desired, go back a step and make any updates such as changing titles, removing the legend if it takes up too much space ('output style' > 'Include the legend?'), or any others.\n5. Once you have a plot you like, choose a meaningful Figure Title and `Save` your workflow state. Doing so will create a handy save point within the `Revisions` history of the Figure. It will also populate the thumbnail of this Figure's card in the project's vulcan homepage. Consider using the `Make public` button as well to make your Figure more visible from the project's vulcan homepage!\n6. (Optional, Advanced) You can also download the 'plot.Rds' output to make additional tweaks in a local version of R. Use the readRDS function to read the object into your local session. If your output style was 'interactive', it will be a plotly object. Otherwise, it will be a ggplot object.\n\n### Planned Feature Additions\n\n- An improved interface for choosing the target sc_seq_dataset. Perhaps just a simple dropdown of known record options, but likely we'll aim to display additional details in the interface that are relevant to making this decision!\n- Additional visualization methods, especially dittoHeatmap and dittoDimHex.\n- Additional methods for setting 'Primary Data' targets of the dittoDotPlot visualization, e.g. from top markers of a DGE output, or copy/paste of a set of genes from a database of signatures hosted in the Data Library.\n\n## Usage Notes\n\n### The Vulcan Interface\n\nThe interface is set up in 3 sections\n\n- The left side is for user inputs. This is where you get to make any choices about how the workflow should run and how any plots should be generated.\n- The center section is where visualizations and any other workflow outputs will appear.\n- The right section allows tracking of the status of all underlying steps of the pipeline.\n\nTo move forwards through the workflow, fill in any input interfaces with your selections and use the `Commit`-button to record your parameterization choices, then use the `Run`-button at the top of the screen to request new work be run.",
  "tags": ["single-cell", "umap"],
  "image": "umap.png",
  "displayName": "scViz",
  "description": "Single-Cell Dataset Visualization: Exploration of Pre-processed Single-Cell Data"
}
