{
  "authors": ["Dan Bunis"],
  "lastModified": "Mar 31, 2021",
  "vignette": "# Workflow for: Single-cell Visualization\n\nThis workflow allows exploration of pre-processed single-cell datasets.\n\n## The Vulcan Interface:\n\nThe interface is set up in 3 sections:\n\n- The left side is for user inputs.\n- The center section is where visualizations and any other workflow outputs will appear.\n- The right section allows tracking of the status of all underlying steps of the pipeline.\n\nTo move forwards through the workflow, fill in any input interfaces with your selections and use the `Commit`-button to record your parameterization choices, then use the `Run`-button at the top of the screen to request new work be run.\n\n## Usage Notes:\n\n- This workflow it Under Construction!\n\n## Overview of Workflow Steps:\n1. Provide the record id of your target sc_seq_dataset.\n2. Vulcan will import this record's Seurat object, then it will present you with an interface for choosing from, and parameterizing, various dittoSeq visualizations.\n3. Choose and `Commit` your plot type, your data targets, and any plot tweaks or additions. Don't worry, you can always go back and adjust these selections later!\n4. Once you have a plot you like, choose a meaningful Figure Title, then use this to `Save` your workflow state. Doing so will create a handy save point in the within the `Revisions` history of the Figure that you can come back to later. It will also populate the thumbnail of this figure's card in the project's vulcan homepage.\n\n### Future Feature Addition Plans:\n\n- A better, perhap purpose-built, interface for initially choosing the target sc_seq_dataset\n- Additional visualization methods, especially dittoDotPlot and dittoHeatmap once we settle on a good UX for the provision of multiple genes.",
  "tags": ["single-cell", "umap"],
  "image": "umap.png",
  "displayName": "scViz",
  "description": "Single-Cell Dataset Visualization: Exploration of Pre-processed Single-Cell Data"
}
