{
  "projects": ["xcrs1", "ipi"],
  "authors": ["Dan Bunis", "Saurabh Asthana"],
  "lastModified": "Oct 19, 2021",
  "vignette": "# Workflow for: Single-cell Gene Expression Processing, Visualization, and Differential Gene Expression\n\nThis workflow performs merging and pre-processing of single-cell data via a standard pipeline (in python, using `scanpy`, for scalability), then allows exploration of the data via umap visualization and differential expression calculation\n\nMany inputs are provided which can be used to tweak how data will be processed for specific use-cases, but it should be noted that ALL of these inputs are initialized with practical defaults. Thus, *users can typically feel comfortable moving forward by simply accepting (or 'commit'ing) the parameters which pop up at the start!* For users initerested in adjusting these parameters, note that hovering your cursor over any (?) icon will reveal documentation about specific inputs.\n\n## Usage Notes:\n\n- When getting to the 'Manually Annotate Clusters' step for the first time, you will need to commit the initial values provided in order to advance to the point of actually being able to examine the clusters in the umap.\n- Prior to UMAP visualization, you will also need to select a non-preliminary differential expression path. This is a bug which will be removed in the future, but until then, the easiest path is to select '1 btwn-all-de-groups' for question type and then choose the 'leiden' option from the 'DiffExp by:' dropdown.\n\n## Overview of Workflow Steps:\n\n The general steps of the workflow include:\n\n- **Data Selection:** Selecting of which single-cell data records to analyze is accomplished by selecting sets of allowed values for specific-attributes of the data records. Records matching those criteria will then be retrieved and presented to the user for approval. Users may then deselect specific records, if needed, and then confirm their final record selections.\n\n- **Merging and processing:** Endpoints of initial processing steps are 1) Clustering and 2) UMAP embedding of cells, as well as 3) differential expression to identify cluster markers. Specifically, raw counts data of selected records are retrieved, imported into `scanpy`, and merged. Afterwards, cells are filtered (based on cutoffs that are among the primary inputs), counts data are normalized and scaled (with optional regression of parameters chosen within primary user inputs), and principal components analysis is run. An optional batch correction adjustment via `harmonypy` can then be performed, which will adjust these PCA embeddings in order to minimize variation associated with the batch-signifying parameter that the user indicates. Next, cell clustering and umap embedding are calculated based on a neighborhood graph which is itself built from either the PCA or harmonypy-adjusted PCA (again, with tunable user inputs). And finally, a preliminary differential gene expression is performed to idenfiy top markers of each cluster by comparing each cluster versus every other cluster in. These DGE results are presented for download, and can be viewed in the next step, as an on-hover overlay of top 10 genes per cluster, when coloring the umap plot by 'Cluster'.\n\n- **Visulaization and Cluster Annotation (optional):** At this stage, users can:\n\n    1. Visualize their data by overlaying metadata or gene expression values on the UMAP.\n    2. Annotate the clusters based on the preliminary differntial expression results. (Hint: when coloring the UMAP by 'Cluster', top markers of each cluster are displayed upon hover!)\n    3. Download the final signel-cell data object to perforfollow up analysis outside of vulcan.\n\n- **Differential Gene Expression (DGE) Analysis (optional):** Users may continue forwards to query differences between cells of their datasets by performing differential expression in various ways. For each of the DGE method options, users can also choose to subset their data first, and eliminate any sets of cells prior to running the DGE calculation. After calculation, DGE results will be filtered based on the 'DGE Cutoffs' inputs, and both the pre-filtering ('full') and post-filtering ('filtered') DGE results will be presented for download. *Note that only the outputs of the most recent differential expression run will be displayed in the user interface at any time, so be sure to download your results between DGE queries when performing multiple!* In addition to control offered among the 'Post UMAP DGE Calculation Inputs', DGE can be run in multiple configurations:\n\n    1. (Multiple) Comparison between all groups of a particular metadata, which is similar to how cluster markers will have already been identified.\n    2. (Single) Comparison between chosen metadata labels within all cells (such as ['disease-state-1', 'disease-state-2'] versus ['control'] of a 'Clinical Annotation' metadata.)\n    3. (Multiple) Comparison between chosen metadata labels (as in 2) while focusing among specific cell groups / types.\n\n### Future Feature Addition Plans:\n\n- Additional visualization methods.\n- Back-end updates to improve the user experience by reducing how often analysis steps are re-run.\n- Back-end updates to make running of differential expression optional prior to UMAP viaualization.\n\n#### Additional Note: Refer to in-line (?) icons for further information about specific steps/inputs.",
  "tags": ["single-cell", "umap", "clustering", "differential expression"],
  "image": "umap.png",
  "displayName": "scRNAseq",
  "description": "scRNAseq Workflow: single-cell data prep & exploration"
}
