{
  "authors": ["Dan Bunis"],
  "lastModified": "Aug 1, 2023",
  "vignette": "# Visualization from Query Workflow\n\nThis standard visualization workflow allows allows plot creation starting from data organized within the data library's relational database, magma.\n\n## Step 1) Select Data via Timur-Query\n\nThis Data Loading method utilizes the 'Data Source magma query' Primary Inputs group. Users can fill in these inputs manually, but the recommended method is to build your query in the Timur-Query page ([documentation](https://mountetna.github.io/query.html)), then click the `Plot` button to have the relevant inputs filled in automatically.\n\n## Optional Step 2) Making Data Adjustments\n\n You can preview your data frame and make adjustments to it, using a spreadsheet-like interface. A subset of Excel [functions are supported](https://handsontable.github.io/hyperformula/guide/built-in-functions.html#overview).\n\n## Step 3) Configuring the plot\n\nAfter data is obtained, the Plot Configuration Interface will appear. First choose your plot type from the similarly named dropdown, then additional inputs will show up which allow you to set what data to use for axes, colors, etc. and as other advanced options.\n\nFor additional details regarding individual inputs of the Plot Configuration Interface, see https://mountetna.github.io/vulcan.html#the-plot-configuration-interface.\n\n## Usage Notes\n\n### The Vulcan Interface\n\nThe interface is set up in 3 sections\n\n- The left side is for user inputs. This is where you get to make any choices about how the workflow should run and how any plots should be generated.\n- The center section is where visualizations and any other workflow outputs will appear.\n- The right section allows tracking of the status of all underlying steps of the pipeline.\n\nTo move forwards through the workflow, fill in any input interfaces with your selections and use the `Confirm`-button to record your parameterization choices, then use the `Run`-button at the top of the screen to request new work be run.",
  "tags": ["general", "plotting"],
  "image": "scatter.png",
  "displayName": "Visualization from Query",
  "description": "Standard Visualization Workflow: Pick data, then create a plot of your choice",
  "inputQueryMap": {
    "1_Data_Source_magma_query__queryTerms": "query",
    "1_Data_Source_magma_query__user_columns": "user_columns",
    "1_Data_Source_magma_query__expand_matrices": "expand_matrices"
  },
  "queryAction": "Visualize directly"
}
